/*
 1. Добавьте свойста 4 новых свойства в объект используя 
    квадратные скобки и точку.
 */

let myObj = {};

/*
 2. Используя метод .slice, добавьте недостающие символы в строку
 */

let sliceString = 'Ytube'; //

console.log(sliceString); // YouTube

/*
  3. Напишите функцию которая будет возвращать объект
  с свойством name, а значением будет первый аргумент функции
*/

/*

  4. Функция будет принимать 1 аргумент - ОБЪЕКТ у которого
   будет свойство name
   и возвращать новый объект изменяя свойство name
   в большой регистр
*/

/*
  5. Напишите функцию которая принимает в
   качестве аргумента массив и элемент массива
  и добавляет элемент в конец массива
*/

/*
  6. Напишите функцию которая получает 3 параметра
  и возвращает объект типа:
     {
       argument1: param1,
       argument2: param2,
       argument3: param3,
     }
*/

/* -> @@ SUPER 2

Напишите функцию, которая будет принимать 4 аргумента,
последний всегда функция.

Добавьте первые 3 аргумента в массив и вызовите переданную функцию с данным массивом

*/

function super2(arg1, arg2, arg3, callback) {

}