// Создайте объект
// Добавьте данному объекту свойства myCars, speed
// выведите в консоле предложение ->
    
// Все мои bmw,vaz ездят на скорости 360












































// Используя методы строки JS, модернизируйте test и отобразите нужное значение 
var test = 'JaScript';
//console.log(test) // JavaScript










/*

 Практическая часть:
 Напишите условие, в котором сценарий пойдет 
 по альтернативной ветке.
 Будет содержать 2 уровня вложенности и будет 
 выполняться самый нижный уровень вложенности

*/



/*






  Используя конструкцию if..else, напишите код, 
  который получает значение prompt, а затем выводит alert:

  1, если значение больше нуля,
  -1, если значение меньше нуля,
  0, если значение равно нулю.

*/


/*
 Classwork 3 - Задача 1:
 
 Сделайте калькулятор в браузере.
 Используйте prompt, Спросите у пользователя два числа
 и верните ему сумму данных чисел через alert;
 Если пользователь указал не число, выведите сообщение об ошибке

 ....
 итерации
 
 */
